import { Component } from '@angular/core';
import { CommonModule } from "@angular/common";

@Component({
  standalone: true,
  selector: 'app-prices-and-documents',
  imports: [CommonModule],
  templateUrl: './prices-and-documents.html',
  styleUrl: './prices-and-documents.scss'
})
export class PricesAndDocuments {
  packageTitle = 'Нашите пакети';
  packages = [
    {
      name: 'Месечен абонамент',
      price: '600 лв.\n(което е около 30 лв. на ден)',
      details: [
        'Ежедневна подготовка на уроци',
        'Помощ за домашни',
        'Индивидуални консултации',
        'Храна (обяд и следобедна закуска)',
        'Достъп до всички извънкласни дейности'
      ]
    },
    {
      name: 'Седмичен абонамент',
      price: '175 лв.\n(по 35 лв. на ден)',
      details: [
        'Ежедневна подготовка на уроци',
        'Помощ за домашни',
        'Храна (обяд и следобедна закуска)',
        'Достъп до всички извънкласни дейности',
        'Без индивидуални консултации'
      ]
    },
    {
      name: 'Еднократно посещение',
      price: '40 лв.',
      details: [
        'Подготовка на уроци',
        'Помощ за домашни',
        'Без достъп до извънкласни дейности',
      ]
    }
  ];

  documentsTitle = 'Необходими документи при записване';
  requiredDocuments = [
    { name: 'Заявление за записване (в секция "Документи")' },
    { name: 'Декларация за самостоятелно напускане или вземане по трети лица (в секция "Документи")' },
    { name: 'Декларация за информирано съгласие за участие в дейности (в секция "Документи")' },
    { name: 'Декларация за съгласие за обработка на лични данни (в секция "Документи")' },
    { name: 'Копие от акта за раждане на детето' },
    {
      name: 'Медицински документи',
      subdocuments: [
        'Здравно-профилактична карта - издадена от личният лекар',
        'Удостоверение от личен лекарм че детето е здраво и може да посещава организирана група',
      ]
    },
    { name: 'Снимка на детето - паспортен формат (1 бр.)' }
  ];
}
