import { Component } from '@angular/core';
import { CommonModule } from "@angular/common";

@Component({
  standalone: true,
  selector: 'app-prices-and-documents',
  imports: [CommonModule],
  templateUrl: './prices-and-documents.html',
  styleUrl: './prices-and-documents.scss'
})
export class PricesAndDocuments {
  packageTitle = 'Нашите пакети';
  packages = [
    {
      name: 'Еднократно посещение',
      price: '40 лв.',
      details: [
        'Идеален за еднократно посещение или пробeн ден',
        'Компетентна помощ за домашни и уроци',
        'Занимания и игри до края на деня',
        'Един ден пълно спокойствие за родителите'
      ]
    },
    {
      name: 'Седмичен абонамент',
      price: '175 лв.\n(по 35 лв. на ден)',
      details: [
        'Помощ с домашни и уроци за цяла седмица',
        'Допълнителни занимания',
        'Участие в спортни и логически игри',
        'Достъп до всички извънкласни дейности',
        'Индивидуална обратна връзка'
      ]
    },
    {
      name: 'Месечен абонамент',
      price: '600 лв.\n(около 30 лв. на ден)',
      details: [
        'Неограничен достъп за целия месец',
        'Помощ за домашни и подготовка за изпити',
        'Разширени занимания по интереси',
        'Ежедневна комуникация с родителите',
        'Отстъпка от цената на еднократните пакети'
      ]
    }
  ];

  documentsTitle = 'Необходими документи при записване';
  requiredDocuments = [
    { name: 'Заявление за записване (в секция "Документи")' },
    { name: 'Декларация за самостоятелно напускане или вземане по трети лица (в секция "Документи")' },
    { name: 'Декларация за информирано съгласие за участие в дейности (в секция "Документи")' },
    { name: 'Декларация за съгласие за обработка на лични данни (в секция "Документи")' },
    { name: 'Копие от акта за раждане на детето' },
    {
      name: 'Медицински документи',
      subdocuments: [
        'Здравно-профилактична карта - издадена от личният лекар',
        'Удостоверение от личен лекарм че детето е здраво и може да посещава организирана група',
      ]
    },
    { name: 'Снимка на детето - паспортен формат (1 бр.)' }
  ];
}
